### EDA & Visualization

In [1]:
%pwd

'c:\\Arjun_Works\\SalesNexus\\research'

In [2]:
import os 
os.chdir('../')
%pwd

'c:\\Arjun_Works\\SalesNexus'

In [3]:
import pandas as pd

try:
  train_df = pd.read_csv("artifacts/data_acquisition/train_merge.csv")
  test_df = pd.read_csv("artifacts/data_acquisition/test_merge.csv")

except FileNotFoundError:
  print("Files not found. Please ensure the data files are in the correct directory.")

In [4]:
train_df.head()

,id,date,store_nbr,family,sales,onpromotion,city,state,type_x,cluster,transactions
0,0,2013-01-01,1,AUTOMOTIVE,0.0,0,Quito,Pichincha,D,13,NaN
1,1,2013-01-01,1,BABY CARE,0.0,0,Quito,Pichincha,D,13,NaN
2,2,2013-01-01,1,BEAUTY,0.0,0,Quito,Pichincha,D,13,NaN
3,3,2013-01-01,1,BEVERAGES,0.0,0,Quito,Pichincha,D,13,NaN
4,4,2013-01-01,1,BOOKS,0.0,0,Quito,Pichincha,D,13,NaN

In [5]:
test_df.head()

,id,date,store_nbr,family,onpromotion,city,state,type_x,cluster,transactions
0,3000888,2017-08-16,1,AUTOMOTIVE,0,Quito,Pichincha,D,13,NaN
1,3000889,2017-08-16,1,BABY CARE,0,Quito,Pichincha,D,13,NaN
2,3000890,2017-08-16,1,BEAUTY,2,Quito,Pichincha,D,13,NaN
3,3000891,2017-08-16,1,BEVERAGES,20,Quito,Pichincha,D,13,NaN
4,3000892,2017-08-16,1,BOOKS,0,Quito,Pichincha,D,13,NaN

In [6]:
train_target = train_df['sales']
train_df.drop(columns=['sales'], inplace=True)

In [ ]:
train_corr_df = train_df.copy()
train_corr_df['sales'] = train_target

corr = train_corr_df.corr(numeric_only=True)

corr['sales'].sort_values(ascending=False)

sales           1.000000
onpromotion     0.427552
transactions    0.214674
id              0.085820
store_nbr       0.041071
cluster         0.038490
Name: sales, dtype: float64

In [ ]:
import seaborn as sns

import matplotlib.pyplot as plt

plt.figure(figsize=(10, 6))
sns.scatterplot(data=train_corr_df, x='onpromotion', y='sales', alpha=0.3)
sns.regplot(data=train_corr_df, x='onpromotion', y='sales', scatter=False, color='red', line_kws={'linewidth':2})
plt.title('Sales vs Onpromotion')
plt.xlabel('Onpromotion')
plt.ylabel('Sales')
plt.tight_layout()
plt.show()